In [1]:
import pandas as pd

In [2]:
S1_alameda = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S1_alameda.xlsx", header=None)

In [4]:
S1_alamo = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S1_alamo.xlsx", header=None)

In [7]:
S1_berkley = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S1_berkley.xlsx", header=None)

In [8]:
S1_crockett = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S1_crockett.xlsx", header=None)

In [9]:
S1_danville = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S1_danville.xlsx", header=None)

In [10]:
S1_hercules = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S1_hercules .xlsx", header=None)

In [11]:
S1_leandro = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S1_leandro.xlsx", header=None)

In [12]:
S1_lorenzo = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S1_lorenzo.xlsx", header=None)

In [13]:
S1_moraga = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S1_moraga .xlsx", header=None)

In [14]:
S1_oakland_a1 = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S1_oakland_a1.xlsx", header=None)

In [15]:
S1_oakland_a2 = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S1_oakland_a2.xlsx", header=None)

In [16]:
S1_oakland_a3 = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S1_oakland_a3.xlsx", header=None)

In [17]:
S1_oakland_b1 = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S1_oakland_b1.xlsx", header=None)

In [18]:
S1_oakland_b2 = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S1_oakland_b2.xlsx", header=None)

In [19]:
S1_oakland_b3 = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S1_oakland_b3.xlsx", header=None)

In [20]:
S1_orinda = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S1_orinda .xlsx", header=None)

In [21]:
S1_pablo = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S1_pablo .xlsx", header=None)

In [22]:
S1_richmond = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S1_richmond.xlsx", header=None)

In [23]:
S1_selby = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S1_selby.xlsx", header=None)

In [24]:
S1_sobrante = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S1_sobrante.xlsx", header=None)

In [25]:
S1_wc = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S1_wc .xlsx", header=None)

In [26]:
S2_alameda = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S2_alameda.xlsx", header=None)

In [27]:
S2_alamo = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S2_alamo.xlsx", header=None)

In [28]:
S2_berkeley = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S2_berkeley .xlsx", header=None)

In [29]:
S2_crockett = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S2_crockett.xlsx", header=None)

In [30]:
S2_danville = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S2_danville.xlsx", header=None)

In [31]:
S2_hercules = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S2_hercules.xlsx", header=None)

In [32]:
S2_leandro = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S2_leandro .xlsx", header=None)

In [33]:
S2_lorenzo = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S2_lorenzo .xlsx", header=None)

In [34]:
S2_moraga = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S2_moraga.xlsx", header=None)

In [35]:
S2_oakland = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S2_oakland .xlsx", header=None)

In [36]:
S2_orinda = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S2_orinda .xlsx", header=None)

In [37]:
S2_pablo = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S2_pablo.xlsx", header=None)

In [38]:
s2_richmond = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\s2_richmond.xlsx", header=None)

In [39]:
S2_selby = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S2_selby .xlsx", header=None)

In [40]:
S2_sobrante = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S2_sobrante.xlsx", header=None)

In [41]:
S2_wc = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S2_wc.xlsx", header=None)

In [45]:
S2_alameda.head()

,0,1,2,3,4,5,6,7
0,Pseudo ID,BCC,BEGIN_DATE,END_DATE,CCF,ELEVATION_BAND,CITY_NAME,ZIP_CODE
1,94501-1,8800,12/8/2015,2/10/2016,4.000,1,Alameda,945014615
2,94501-1,8800,2/10/2016,4/9/2016,4.000,1,Alameda,945014615
3,94501-1,8800,10/7/2015,12/8/2015,5.000,1,Alameda,945014615
4,94501-1,8800,8/7/2015,10/7/2015,4.000,1,Alameda,945014615

In [44]:
#Drop first row of S2 dataframes to remove residual header information.

In [47]:
S2_alameda = S2_alameda.iloc[1:]

In [48]:
#Checking that the method worked. 
S2_alameda.head()

         0     1          2          3      4  5        6          7
1  94501-1  8800  12/8/2015  2/10/2016  4.000  1  Alameda  945014615
2  94501-1  8800  2/10/2016   4/9/2016  4.000  1  Alameda  945014615
3  94501-1  8800  10/7/2015  12/8/2015  5.000  1  Alameda  945014615
4  94501-1  8800   8/7/2015  10/7/2015  4.000  1  Alameda  945014615
5  94501-1  8800   6/9/2015   8/7/2015  3.000  1  Alameda  945014615

In [49]:
#Drop for the rest of S2.

In [51]:
S2_alamo = S2_alamo.iloc[1:]
S2_berkeley = S2_berkeley.iloc[1:]
S2_crockett = S2_crockett.iloc[1:]
S2_danville = S2_danville.iloc[1:]
S2_hercules = S2_hercules.iloc[1:]
S2_leandro = S2_leandro.iloc[1:]
S2_lorenzo = S2_lorenzo.iloc[1:]
S2_moraga = S2_moraga.iloc[1:]
S2_oakland = S2_oakland.iloc[1:]
S2_orinda = S2_orinda.iloc[1:]
S2_pablo = S2_pablo.iloc[1:]
s2_richmond = s2_richmond.iloc[1:]
S2_selby = S2_selby.iloc[1:]
S2_sobrante = S2_sobrante.iloc[1:]
S2_wc = S2_wc.iloc[1:]

In [52]:
#Checking to make sure method worked properly. 
S2_hercules.head()

         0     1          2          3       4  5         6          7
1  94547-2  8800   6/2/2015  7/31/2015  20.000  1  Hercules  945471651
2  94547-2  8800  7/31/2015  9/30/2015  19.000  1  Hercules  945471651
3  94547-2  8800  9/30/2015  12/1/2015  10.000  1  Hercules  945471651
4  94547-2  8800  12/1/2015   2/2/2016   2.000  1  Hercules  945471651
5  94547-2  8800   2/2/2016   4/1/2016   7.000  1  Hercules  945471651

In [53]:
S2_moraga.head()

         0     1          2          3       4  5       6          7
1  94556-1  8800   2/5/2016   4/5/2016  13.000  2  Moraga  945561026
2  94556-1  8800  12/3/2015   2/5/2016  32.000  2  Moraga  945561026
3  94556-1  8800  10/2/2015  12/3/2015   8.000  2  Moraga  945561026
4  94556-1  8800   8/4/2015  10/2/2015   9.000  2  Moraga  945561026
5  94556-1  8800   6/4/2015   8/4/2015   9.000  2  Moraga  945561026

In [54]:
# Concat the data frames into a single new frame named water_use

frames = [S1_alameda, S1_alamo, S1_berkley, S1_crockett, S1_danville, S1_hercules, S1_leandro, S1_lorenzo, S1_moraga, 
         S1_oakland_a1, S1_oakland_a2, S1_oakland_a3, S1_oakland_b1, S1_oakland_b2, S1_oakland_b3 , S1_orinda, S1_pablo, 
         S1_richmond, S1_selby, S1_sobrante, S1_wc, S2_alameda, S2_alamo, S2_berkeley, S2_crockett, S2_danville, S2_hercules, 
         S2_leandro, S2_lorenzo, S2_moraga, S2_oakland, S2_orinda, S2_pablo, s2_richmond, S2_selby, S2_sobrante, S2_wc]
water_use = pd.concat(frames)

In [56]:
# Count in order to see if we have an appropriate number of rows. We 10.5 million rows, seems correct. 

water_use.count(axis=1)

0         8
1         8
2         8
3         8
4         8
         ..
108299    8
108300    8
108301    8
108302    8
108303    8
Length: 10544323, dtype: int64

In [58]:
water_use.head(10)

,Pseudo_ID,Customer_Type,Start_Date,End_Date,CCF Used,Elevation_Code,City,Zip_Code
0,94502-4797,8800,2012-04-05 00:00:00,2012-06-05 00:00:00,26,1,Alameda,945027714
1,94502-4797,8800,2012-06-05 00:00:00,2012-08-03 00:00:00,32,1,Alameda,945027714
2,94502-4797,8800,2012-08-03 00:00:00,2012-10-03 00:00:00,30,1,Alameda,945027714
3,94502-4797,8800,2012-10-03 00:00:00,2012-12-04 00:00:00,21,1,Alameda,945027714
4,94502-4797,8800,2012-12-04 00:00:00,2013-02-05 00:00:00,20,1,Alameda,945027714
5,94502-4797,8800,2013-02-05 00:00:00,2013-04-08 00:00:00,29,1,Alameda,945027714
6,94502-4797,8800,2013-04-08 00:00:00,2013-06-07 00:00:00,26,1,Alameda,945027714
7,94502-4797,8800,2013-06-07 00:00:00,2013-08-06 00:00:00,30,1,Alameda,945027714
8,94502-4797,8800,2013-08-06 00:00:00,2013-10-04 00:00:00,32,1,Alameda,945027714
9,94502-4797,8800,2013-10-04 00:00:00,2013-12-03 00:00:00,35,1,Alameda,945027714